ДЗ:


1. Определение наивысшей текущей зарплаты в каждом отделе (для подсчета текущей зарплаты, используем фильтр WHERE to_date = '9999-01-01'):
   - Цель: Найти наивысшую текущую зарплату в каждом отделе.
   - Таблицы для использования: salaries (содержит информацию о зарплатах сотрудников), dept_emp (содержит информацию о том, к каким отделам относятся сотрудники).
   - Колонки для отображения: Идентификатор сотрудника (emp_no), зарплата (salary), номер отдела (dept_no), наивысшая зарплата в отделе (max_salary_in_dept).




2. Сравнение зарплаты каждого сотрудника с средней зарплатой в их отделе:
   - Цель: Сравнить зарплату каждого сотрудника с средней зарплатой в его/ее отделе.
   - Таблицы для использования: salaries, dept_emp.
   - Колонки для отображения: Идентификатор сотрудника (emp_no), зарплата (salary), номер отдела (dept_no), средняя зарплата в отделе (avg_salary_in_dept).



3. Ранжирование сотрудников в отделе по стажу работы:
   - Цель: Ранжировать сотрудников в каждом отделе по длительности их работы в компании.
   - Таблицы для использования: employees (содержит информацию о сотрудниках, включая дату найма), dept_emp.
   - Колонки для отображения: Идентификатор сотрудника (emp_no), дата найма (hire_date), номер отдела (dept_no), ранг опыта (experience_rank). То есть мы хотим разделить на партиции по департаменту и сортировать по hire_date.



4.Нахождение следующей должности каждого сотрудника:
   - Цель: Определить, какая должность будет следующей для каждого сотрудника в ходе их карьеры.
   - Таблицы для использования: titles (содержит информацию о должностях сотрудников).
   - Колонки для отображения: Идентификатор сотрудника (emp_no), текущая должность (title), следующая должность (next_title).




5. Определение начальной и последней зарплаты сотрудника:
   - Цель: Узнать, какая была начальная и какая текущая зарплата у каждого сотрудника.
   - Таблицы для использования: salaries (содержит информацию о зарплатах сотрудников).
   - Колонки для отображения: Идентификатор сотрудника (emp_no), текущая зарплата (salary), начальная зарплата (first_salary), последняя зарплата (last_salary).



6. - Цель: Вычислить скользящее среднее зарплаты для каждого сотрудника, основываясь на его последних трех зарплатах.
- Таблицы для использования: salaries: содержит информацию о зарплатах сотрудников, включая emp_no (идентификатор сотрудника), salary (зарплата), и from_date (дата начала действия зарплаты).
- Колонки для отображения: emp_no (идентификатор сотрудника), from_date (дата начала действия зарплаты), salary (зарплата), moving_avg_salary (скользящее среднее зарплаты, рассчитанное на основе последних трех зарплат);










1 Определение наивысшей текущей зарплаты в каждом отделе (для подсчета текущей зарплаты, используем фильтр WHERE to_date = '9999-01-01')
   - Цель: Найти наивысшую текущую зарплату в каждом отделе
   - Таблицы для использования: salaries (содержит информацию о зарплатах сотрудников), dept_emp (содержит информацию о том, к каким отделам относятся сотрудники)
   - Колонки для отображения: Идентификатор сотрудника (emp_no), зарплата (salary), номер отдела (dept_no), наивысшая зарплата в отделе (max_salary_in_dept);
   


select s.emp_no, s.salary, de.dept_no, max(s.salary) over (partition by de.dept_no) as max_salary_in_dept
from salaries s
join dept_emp de on s.emp_no = de.emp_no
where s.to_date = '9999-01-01'
and de.to_date = '9999-01-01';




2 Сравнение зарплаты каждого сотрудника с средней зарплатой в их отделе
   - Цель: Сравнить зарплату каждого сотрудника с средней зарплатой в его/ее отделе
   - Таблицы для использования: salaries, dept_emp
   - Колонки для отображения: Идентификатор сотрудника (emp_no), зарплата (salary), номер отдела (dept_no), средняя зарплата в отделе (avg_salary_in_dept);
   
   
select s.emp_no, s.salary, de.dept_no, avg(s.salary) over (partition by de.dept_no) as avg_salary_in_dept
from salaries s
join dept_emp de on s.emp_no = de.emp_no
where s.to_date = '9999-01-01'
and de.to_date = '9999-01-01';







3 Ранжирование сотрудников в отделе по стажу работы
   - Цель: Ранжировать сотрудников в каждом отделе по длительности их работы в компании
   - Таблицы для использования: employees (содержит информацию о сотрудниках, включая дату найма), dept_emp
   - Колонки для отображения: Идентификатор сотрудника (emp_no), дата найма (hire_date), номер отдела (dept_no), ранг опыта (experience_rank). То есть мы хотим разделить на партиции по департаменту и сортировать по hire_date;




select * from employees;

select e.emp_no, e.hire_date, de.dept_no, rank() over (partition by de.dept_no order by e.hire_date) as experience_rank
from employees e
join dept_emp de on e.emp_no = de.emp_no
where de.to_date = '9999-01-01';







4 Нахождение следующей должности каждого сотрудника
   - Цель: Определить, какая должность будет следующей для каждого сотрудника в ходе их карьеры
   - Таблицы для использования: titles (содержит информацию о должностях сотрудников)
   - Колонки для отображения: Идентификатор сотрудника (emp_no), текущая должность (title), следующая должность (next_title);
   
   
   
   
select emp_no, title, lead(title) over (partition by emp_no order by from_date) as next_title
from titles;






5 Определение начальной и последней зарплаты сотрудника
   - Цель: Узнать, какая была начальная и какая текущая зарплата у каждого сотрудника
   - Таблицы для использования: salaries (содержит информацию о зарплатах сотрудников)
   - Колонки для отображения: Идентификатор сотрудника (emp_no), текущая зарплата (salary), начальная зарплата (first_salary), последняя зарплата (last_salary);
   
   
   
select emp_no, salary, first_value(salary) over (partition by emp_no order by from_date) as first_salary, last_value(salary) over (partition by emp_no order by from_date rows between unbounded preceding and unbounded following) as last_salary
from salaries;







6 Цель: Вычислить скользящее среднее зарплаты для каждого сотрудника, основываясь на его последних трех зарплатах
- Таблицы для использования: salaries: содержит информацию о зарплатах сотрудников, включая emp_no (идентификатор сотрудника), salary (зарплата), и from_date (дата начала действия зарплаты)
- Колонки для отображения: emp_no (идентификатор сотрудника), from_date (дата начала действия зарплаты), salary (зарплата), moving_avg_salary (скользящее среднее зарплаты, рассчитанное на основе последних трех зарплат);



select emp_no, from_date, salary, avg(salary) over (partition by emp_no order by from_date rows between 2 preceding and current row) as moving_avg_salary
from salaries;







